In [1]:
#Loading Packages
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
#Loading Data
data = pd.read_csv('Data_analyst_intern1.csv')

In [3]:
data.duplicated().sum()

0

In [4]:
#checking for null values
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 533327 entries, 0 to 533326
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           533327 non-null  int64
 1   customer_id  533327 non-null  int64
 2   location_id  533327 non-null  int64
 3   channel      533327 non-null  object
 4   amount       533327 non-null  int64
 5   bill_no      533327 non-null  object
 6   created_on   533327 non-null  object
 7   month        533327 non-null  int64
dtypes: int64(5), object(3)
memory usage: 32.6+ MB

In [5]:
data.tail(5)

,id,customer_id,location_id,channel,amount,bill_no,created_on,month
533322,63920571,11655184,218,zomato,674,GGN004-49266,10-04-19,4
533323,63920575,11655185,4002,dine in,1565,DEL009-26660,10-04-19,4
533324,63920583,11655186,194,zomato,217,GGN002-70779,10-04-19,4
533325,63920586,11655187,192,uber,252,GGN001-88302,10-04-19,4
533326,63920591,11655188,4002,uber,252,DEL009-26737,10-04-19,4

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 533327 entries, 0 to 533326
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           533327 non-null  int64
 1   customer_id  533327 non-null  int64
 2   location_id  533327 non-null  int64
 3   channel      533327 non-null  object
 4   amount       533327 non-null  int64
 5   bill_no      533327 non-null  object
 6   created_on   533327 non-null  object
 7   month        533327 non-null  int64
dtypes: int64(5), object(3)
memory usage: 32.6+ MB

In [7]:
revenue=data.groupby(['month'])['amount'].sum()

In [8]:
orders=data.groupby('month').bill_no.count()

In [9]:
Customers=data.groupby('month').customer_id.nunique()

In [10]:
def new_customer(x,y):
    if x ==0:
        return None
    else:
        return y
data['NewCol'] = data.apply(lambda x: new_customer(x['amount'], x['customer_id']), axis=1)
#data['new_customer_id'] = data.apply(new_customer,args=(data['amount'],data['customer_id']))

In [11]:

data.head(5)

,id,customer_id,location_id,channel,amount,bill_no,created_on,month,NewCol
0,42877344,60,192,uber,1039,GGN001-24323,24-06-18,6,60.0
1,35625005,134,535,takeaway,1029,DEL007-1522,14-01-18,1,134.0
2,44397299,166,347,uber,355,DEL005-29173,13-09-18,9,166.0
3,44405460,166,347,uber,371,DEL005-29180,13-09-18,9,166.0
4,44717004,166,347,uber,371,DEL005-29603,16-09-18,9,166.0

In [12]:
new_customer=data.groupby('month').NewCol.nunique()

In [37]:
print('Month ','Amount  ','Orders ','Customers ','New Customers   ','Frequency      ')
for i in range(1,13):
    print(i,'   ',revenue[i],' ',orders[i],'  ',Customers[i],'  ',new_customer[i],'        ',orders[i]/Customers[i])

Month  Amount   Orders  Customers  New Customers    Frequency
1     32618857   54308    38558    38548          1.40847554333731
2     34069472   64467    46386    46321          1.3897943344974777
3     40856589   85777    59422    59187          1.4435226010568476
4     21906207   43651    32111    31988          1.3593784061536545
5     15520988   27844    19786    19786          1.4072576569291417
6     16853200   29488    21234    21234          1.388716209852124
7     19219256   32578    23862    23862          1.3652669516385885
8     15657494   26533    20230    20230          1.3115669797330698
9     16686127   35130    25731    25731          1.3652792351638101
10     23063965   39498    28381    28330          1.391705718614566
11     31717713   52036    36952    36952          1.4082052392292703
12     25906568   42017    31239    31210          1.3450174461410416